KamilDuljas/STM32L476RG_Projects/DCS-STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define LCD_D4_Pin GPIO_PIN_6
#define LCD_D4_GPIO_Port GPIOA
#define LCD_D5_Pin GPIO_PIN_7
#define LCD_D5_GPIO_Port GPIOA
#define ICP_ENTR_BTN_Pin GPIO_PIN_5
#define ICP_ENTR_BTN_GPIO_Port GPIOC
#define ICP_WX_BTN_Pin GPIO_PIN_1
#define ICP_WX_BTN_GPIO_Port GPIOB
#define ICP_AG_MODE_BTN_Pin GPIO_PIN_2
#define ICP_AG_MODE_BTN_GPIO_Port GPIOB
#define ICP_AA_MODE_BTN_Pin GPIO_PIN_11
#define ICP_AA_MODE_BTN_GPIO_Port GPIOB
#define ICP_LIST_BTN_Pin GPIO_PIN_12
#define ICP_LIST_BTN_GPIO_Port GPIOB
#define ICP_COM2_BTN_Pin GPIO_PIN_6
#define ICP_COM2_BTN_GPIO_Port GPIOC
#define LCD_D7_Pin GPIO_PIN_7
#define LCD_D7_GPIO_Port GPIOC
#define ICP_COM1_BTN_Pin GPIO_PIN_8
#define ICP_COM1_BTN_GPIO_Port GPIOC
#define LCD_RS_Pin GPIO_PIN_8
#define LCD_RS_GPIO_Port GPIOA
#define LCD_E_Pin GPIO_PIN_9
#define LCD_E_GPIO_Port GPIOA
#define ICP_IFF_BTN_Pin GPIO_PIN_11
#define ICP_IFF_BTN_GPIO_Port GPIOA
#define LCD_D6_Pin GPIO_PIN_6
#define LCD_D6_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
